app/controllers/api/v1/forums_controller.rb

  def index
    @forums=Forum.all
---
SELECT "forums".* FROM "forums"