app/controllers/api/v1/friendships_controller.rb

SELECT "friendships".* FROM "friendships"
---
  def index
    @friendships=Friendship.all