app/controllers/api/v1/messages_controller.rb

INSERT INTO "messages" ("user_id", "forum_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["forum_id", 1], ["content", "hello m"], ["created_at", "2019-03-28 17:54:14.953685"], ["updated_at", "2019-03-28 17:54:14.953685"]]
---
  def create
    @message = Message.create(message_params)

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def check_forum_exist
    f= Forum.find(params[:forum_id])