app/controllers/api/v1/rides_controller.rb

SELECT "rides".* FROM "rides"
---
  def index
    @rides=Ride.all