app/controllers/api/v1/users_controller.rb

  def index
    @users=User.all
    render json: @users, :include => [:companies,:rides,:messages,:forums]#,:followers]
---
SELECT "users".* FROM "users"
SELECT "companies".* FROM "companies" INNER JOIN "user_companies" ON "companies"."id" = "user_companies"."company_id" WHERE "user_companies"."user_id" = $1  [["user_id", 1]]
SELECT "forums".* FROM "forums" INNER JOIN "messages" ON "forums"."id" = "messages"."forum_id" WHERE "messages"."user_id" = $1  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."forum_id" = $1  [["forum_id", 2]]

  def update
    user = get_user
    user.update(user_params)

    companies = []
    company_params.each do|c|
      company = Company.find(c[:id])
      companies << company
---
UPDATE "users" SET "experience" = $1, "rating" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["experience", 100], ["rating", 4], ["updated_at", "2019-03-26 17:32:23.862688"], ["id", 6]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
INSERT INTO "user_companies" ("company_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["company_id", 2], ["user_id", 1], ["created_at", "2019-03-27 19:00:34.627681"], ["updated_at", "2019-03-27 19:00:34.627681"]]