app/controllers/api/v1/users_controller.rb

  def update
    byebug
    @user = get_user
    @user.update(user_params)
---
UPDATE "users" SET "experience" = $1, "rating" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["experience", 12], ["rating", 25], ["updated_at", "2019-03-26 19:33:38.915894"], ["id", 4]]

  def get_user
    @user=User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]